In [1]:
import pandas as pd
import numpy as np
import datetime

In [2]:
import sqlite3
conn = sqlite3.connect("AdventureWorks.db")
cursor = conn.cursor()

In [3]:
query = "select * from FactSales"
factsales = pd.read_sql_query(query, conn)
factsales.head()

,OrderDate,StockDate,OrderNumber,ProductKey,CustomerKey,TerritoryKey,OrderLineItem,OrderQuantity
0,2015-01-01,2001-09-21,SO45080,332,14657,1,1,1
1,2015-01-01,2001-12-05,SO45079,312,29255,4,1,1
2,2015-01-01,2001-10-29,SO45082,350,11455,9,1,1
3,2015-01-01,2001-11-16,SO45081,338,26782,6,1,1
4,2015-01-02,2001-12-15,SO45083,312,14947,10,1,1

In [4]:
query = "select * from DimCustomer"
customers = pd.read_sql_query(query, conn)
customers.head()

,CustomerKey,Prefix,FirstName,LastName,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner
0,CustomerKey,Prefix,FirstName,LastName,BirthDate,MaritalStatus,Gender,EmailAddress,AnnualIncome,TotalChildren,EducationLevel,Occupation,HomeOwner
1,11000,MR.,JON,YANG,4/8/1966,M,M,jon24@adventure-works.com,"$90,000",2,Bachelors,Professional,Y
2,11001,MR.,EUGENE,HUANG,5/14/1965,S,M,eugene10@adventure-works.com,"$60,000",3,Bachelors,Professional,N
3,11002,MR.,RUBEN,TORRES,8/12/1965,M,M,ruben35@adventure-works.com,"$60,000",3,Bachelors,Professional,Y
4,11003,MS.,CHRISTY,ZHU,2/15/1968,S,F,christy12@adventure-works.com,"$70,000",0,Bachelors,Professional,N

In [5]:
query = "select * from DimCalendar"
calendar = pd.read_sql_query(query, conn)
calendar.head()

         date
0  01/01/2015
1  01/02/2015
2  01/03/2015
3  01/04/2015
4  01/05/2015

In [6]:
query = "select * from DimProductCategories"
productcategories = pd.read_sql_query(query, conn)
productcategories.head()

   productcategorykey  categoryname
0  ProductCategoryKey  CategoryName
1                   1         Bikes
2                   2    Components
3                   3      Clothing
4                   4   Accessories

In [7]:
query = "select * from DimProduct_Subcategories"
product_subcategories = pd.read_sql_query(query, conn)
product_subcategories.head()

   ProductSubcategoryKey  SubcategoryName  ProductCategoryKey
0  ProductSubcategoryKey  SubcategoryName  ProductCategoryKey
1                      1   Mountain Bikes                   1
2                      2       Road Bikes                   1
3                      3    Touring Bikes                   1
4                      4       Handlebars                   2

In [8]:
query = "select * from DimProducts"
products = pd.read_sql_query(query, conn)
products.head()

,ProductKey,ProductSubcategoryKey,ProductSKU,ProductName,ModelName,ProductDescription,ProductColor,ProductSize,ProductStyle,ProductCost,ProductPrice
0,214,31,HL-U509-R,"Sport-100 Helmet, Red",Sport-100,"Universal fit, well-vented, lightweight , snap...",Red,0,0,13.0863,34.9900
1,215,31,HL-U509,"Sport-100 Helmet, Black",Sport-100,"Universal fit, well-vented, lightweight , snap...",Black,0,0,12.0278,33.6442
2,218,23,SO-B909-M,"Mountain Bike Socks, M",Mountain Bike Socks,Combination of natural and synthetic fibers st...,White,M,U,3.3963,9.5000
3,219,23,SO-B909-L,"Mountain Bike Socks, L",Mountain Bike Socks,Combination of natural and synthetic fibers st...,White,L,U,3.3963,9.5000
4,220,31,HL-U509-B,"Sport-100 Helmet, Blue",Sport-100,"Universal fit, well-vented, lightweight , snap...",Blue,0,0,12.0278,33.6442

In [9]:
query = "select * from DimTerritories"
territories = pd.read_sql_query(query, conn)
territories.head()

   SalesTerritoryKey     Region        Country      Continent
0                  1  Northwest  United States  North America
1                  2  Northeast  United States  North America
2                  3    Central  United States  North America
3                  4  Southwest  United States  North America
4                  5  Southeast  United States  North America

In [10]:
query = "select * from FactReturns"
returns = pd.read_sql_query(query, conn)
returns.head()

   ReturnDate  TerritoryKey  ProductKey  ReturnQuantity
0  2015-01-18             9         312               1
1  2015-01-18            10         310               1
2  2015-01-21             8         346               1
3  2015-01-22             4         311               1
4  2015-02-02             6         312               1

In [11]:
factsales.isnull().sum()

OrderDate        0
StockDate        0
OrderNumber      0
ProductKey       0
CustomerKey      0
TerritoryKey     0
OrderLineItem    0
OrderQuantity    0
dtype: int64

In [12]:
factsales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56046 entries, 0 to 56045
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   OrderDate      56046 non-null  object
 1   StockDate      56046 non-null  object
 2   OrderNumber    56046 non-null  object
 3   ProductKey     56046 non-null  int64
 4   CustomerKey    56046 non-null  int64
 5   TerritoryKey   56046 non-null  int64
 6   OrderLineItem  56046 non-null  int64
 7   OrderQuantity  56046 non-null  int64
dtypes: int64(5), object(3)
memory usage: 3.4+ MB

In [13]:
# Conversion of Orderdate column to date data type 
factsales['OrderDate'] = pd.to_datetime(factsales['OrderDate'])

In [14]:
# Conversion of stockdate column to date data type 
factsales['StockDate'] = pd.to_datetime(factsales['StockDate'])

In [15]:
factsales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56046 entries, 0 to 56045
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   OrderDate      56046 non-null  datetime64[ns]
 1   StockDate      56046 non-null  datetime64[ns]
 2   OrderNumber    56046 non-null  object
 3   ProductKey     56046 non-null  int64
 4   CustomerKey    56046 non-null  int64
 5   TerritoryKey   56046 non-null  int64
 6   OrderLineItem  56046 non-null  int64
 7   OrderQuantity  56046 non-null  int64
dtypes: datetime64[ns](2), int64(5), object(1)
memory usage: 3.4+ MB

In [16]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18149 entries, 0 to 18148
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   CustomerKey     18149 non-null  object
 1   Prefix          18019 non-null  object
 2   FirstName       18149 non-null  object
 3   LastName        18149 non-null  object
 4   BirthDate       18149 non-null  object
 5   MaritalStatus   18149 non-null  object
 6   Gender          18149 non-null  object
 7   EmailAddress    18149 non-null  object
 8   AnnualIncome    18149 non-null  object
 9   TotalChildren   18149 non-null  object
 10  EducationLevel  18149 non-null  object
 11  Occupation      18149 non-null  object
 12  HomeOwner       18149 non-null  object
dtypes: object(13)
memory usage: 1.8+ MB

In [20]:
# Replacing Null in prefix to mr 
customers['Prefix'] = customers['Prefix'].fillna('Mr')

In [26]:
customers.isnull().sum()

CustomerKey       0
Prefix            0
FirstName         0
LastName          0
BirthDate         0
MaritalStatus     0
Gender            0
EmailAddress      0
AnnualIncome      0
TotalChildren     0
EducationLevel    0
Occupation        0
HomeOwner         0
dtype: int64

In [22]:
calendar.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 912 entries, 0 to 911
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    912 non-null    object
dtypes: object(1)
memory usage: 7.3+ KB

In [23]:
# this table is clean with no null values 
calendar.isnull().sum()

date    0
dtype: int64

In [27]:
# this table is clean with no null values 
productcategories.isnull().sum()

productcategorykey    0
categoryname          0
dtype: int64

In [28]:
# this table is clean with no null values 
product_subcategories.isnull().sum()

ProductSubcategoryKey    0
SubcategoryName          0
ProductCategoryKey       0
dtype: int64

In [29]:
# this table is clean with no null values 
products.isnull().sum()

ProductKey               0
ProductSubcategoryKey    0
ProductSKU               0
ProductName              0
ModelName                0
ProductDescription       0
ProductColor             0
ProductSize              0
ProductStyle             0
ProductCost              0
ProductPrice             0
dtype: int64

In [30]:
# this table is clean with no null values 
territories.isnull().sum()

SalesTerritoryKey    0
Region               0
Country              0
Continent            0
dtype: int64

In [31]:
# this table is clean with no null values 
returns.isnull().sum()

ReturnDate        0
TerritoryKey      0
ProductKey        0
ReturnQuantity    0
dtype: int64